In [ ]:
!pip install pandas

In [8]:
import pandas as pd

In [9]:
dicionario = {
    'A':[1, 2, 3],
    'B':[-3, -2, -1],
    'C': [0, 10, 20]
}
Label = ['Linha 1', 'Linha 2', 'Linha 3']
Dataframe_01 = pd.DataFrame(dicionario, index=Label)
print(Dataframe_01)

         A  B   C
Linha 1  1 -3   0
Linha 2  2 -2  10
Linha 3  3 -1  20

In [10]:
Dataframe_01[['A','B']]

         A  B
Linha 1  1 -3
Linha 2  2 -2
Linha 3  3 -1

In [11]:
Dataframe_01['Nova Coluna'] = Dataframe_01['A'] *Dataframe_01['B']

In [12]:
Dataframe_01

         A  B   C  Nova Coluna
Linha 1  1 -3   0           -3
Linha 2  2 -2  10           -4
Linha 3  3 -1  20           -3

In [13]:
a =6
print(a)
Dataframe_01

6

         A  B   C  Nova Coluna
Linha 1  1 -3   0           -3
Linha 2  2 -2  10           -4
Linha 3  3 -1  20           -3

In [14]:
#Excluir coluna
Dataframe_01.drop('Nova Coluna', axis=1)

         A  B   C
Linha 1  1 -3   0
Linha 2  2 -2  10
Linha 3  3 -1  20

In [15]:
#definitivo
Dataframe_01.drop('Nova Coluna', axis=1, inplace=True)

In [17]:
Dataframe_01.loc['Linha 1']

A    1
B   -3
C    0
Name: Linha 1, dtype: int64

In [18]:
Dataframe_01.loc['Linha 2']

A     2
B    -2
C    10
Name: Linha 2, dtype: int64

In [19]:
Dataframe_01.loc[['Linha 1', 'Linha 2'], ['A', 'C']]

         A   C
Linha 1  1   0
Linha 2  2  10

In [20]:
Dataframe_01.iloc[0:4, 0:]

         A  B   C
Linha 1  1 -3   0
Linha 2  2 -2  10
Linha 3  3 -1  20

In [21]:
# Localizando a linha e a coluna pelo indice
Dataframe_01.iloc[2:3,1:] # Linha, coluna

         B   C
Linha 3 -1  20

In [22]:
Dataframe_01.iloc[2:3,1:] # Linha, coluna

         B   C
Linha 3 -1  20

In [23]:
# Verificando as condiçoes no DataFrame
print(Dataframe_01)
Dataframe_01 >0

         A  B   C
Linha 1  1 -3   0
Linha 2  2 -2  10
Linha 3  3 -1  20

            A      B      C
Linha 1  True  False  False
Linha 2  True  False   True
Linha 3  True  False   True

In [25]:
#Criando filtro no Dataframe
Filtro = Dataframe_01['C'] >0 # Armazena em filtro a resposta da verificação
DataFrame_02= Dataframe_01[Filtro] # Cria um novo Dataframe
DataFrame_02['A']

Linha 2    2
Linha 3    3
Name: A, dtype: int64

In [26]:
Filtro

Linha 1    False
Linha 2     True
Linha 3     True
Name: C, dtype: bool

In [27]:
# Cria um filtro utilizando a condição &
Dataframe_01[(Dataframe_01['A']>1) & (Dataframe_01['C']>0)]

         A  B   C
Linha 2  2 -2  10
Linha 3  3 -1  20

In [28]:
# Cria um filtro utilizando a condição or
Dataframe_01[(Dataframe_01['B']>5) | (Dataframe_01['C']>2)]

         A  B   C
Linha 2  2 -2  10
Linha 3  3 -1  20

In [29]:
#Resetando o index do Dataframe
Dataframe_01.reset_index()

     index  A  B   C
0  Linha 1  1 -3   0
1  Linha 2  2 -2  10
2  Linha 3  3 -1  20

In [30]:
Dataframe_01

         A  B   C
Linha 1  1 -3   0
Linha 2  2 -2  10
Linha 3  3 -1  20

In [31]:
Dataframe_01.reset_index(inplace=True)

In [32]:
Dataframe_01

     index  A  B   C
0  Linha 1  1 -3   0
1  Linha 2  2 -2  10
2  Linha 3  3 -1  20

In [33]:
Dataframe_01.drop('index',axis=1,inplace=True) # exclui coluna index

In [34]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [35]:
# Criando varios dicionarios
Dicionario_01 ={
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20],
    'Chave':['AA','BB','CC']
}

# Dicionario 2
Dicionario_02= {
    'A':[6,7,8],
    'B':[-39,-28,-17],
    'C':[1000,10,60],
    'Chave':['AA','BB','CC']
}

# Dicionario 3

Dicionario_03 ={
    'A':[11,12,13],
    'B':[-39,-22,-11],
    'C':[30,10,20],
    'Chave':['AA','BB','CC']
}

# Criando as listas para serem os labels
Label_01 = ['1ª Linha','2ª Linha','3ª Linha']
Label_02 = ['4ª Linha','5ª Linha','6ª Linha']
Label_03 = ['7ª Linha','8ª Linha','9ª Linha']

# Criando os dataframes

Dataframe_01n =pd.DataFrame(Dicionario_01,index= Label_01)
Dataframe_02n =pd.DataFrame(Dicionario_02,index= Label_02)
Dataframe_03 =pd.DataFrame(Dicionario_03,index= Label_03)

In [36]:
Dataframe_01n # exibe o Dataframe 1

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC

In [37]:
Dataframe_02n

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB
6ª Linha  8 -17    60    CC

In [38]:
Dataframe_03

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [39]:
# Empilhando os Dataframes 1,2 e 3
pd.concat([Dataframe_01n,Dataframe_02n,Dataframe_03])

           A   B     C Chave
1ª Linha   1 -32    60    AA
2ª Linha   2 -21    10    BB
3ª Linha   3 -15    20    CC
4ª Linha   6 -39  1000    AA
5ª Linha   7 -28    10    BB
6ª Linha   8 -17    60    CC
7ª Linha  11 -39    30    AA
8ª Linha  12 -22    10    BB
9ª Linha  13 -11    20    CC

In [40]:
# Mescla os dataframes utilizando o merge how inner verifica se a chave esta presente em
# ambos os lados do dataframe
pd.merge(Dataframe_01n,Dataframe_02n,how='inner',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [41]:
pd.merge(Dataframe_01n,Dataframe_03,how='left',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [42]:
pd.merge(Dataframe_01n,Dataframe_03,how='right',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [43]:
pd.merge(Dataframe_01n,Dataframe_02n,how='outer',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60